DataProcessors/ПриемкаКоллективная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриемкаКоллективная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемкиГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаОтВнешнегоПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСостояниеКодаВЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоответствиеКодаТоваруПоGTIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПриниматьКМБезПроверкиСостояния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьКодыСОжидаемымиПриПриемке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СписокТоваровДокументаПТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СписокТоваровДокументаПТУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаименованиеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПроизводителяТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормализованныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЕдиИзм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТовараНабрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВРазмещении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОформление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаАВСФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварТребуетсяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОжидаемыхМаркировок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВБуфереМаркировок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтсканированныхМаркировок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТоваровСМаркировкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРазместитьДляВозврата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПревышенаДатаМаркировкиОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаПТУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПриемкаКоллективная/Forms/ФормаГМДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ШтрихКод; 

&НаКлиенте
Процедура ПоказатьРазмещенные(Команда)
	РазмещенныеТоварыПоказаны = Истина;
	ПоказатьПунктМенюРазмещенныеСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьРазмещенные(Команда)	
	РазмещенныеТоварыПоказаны = Ложь;
	ПоказатьПунктМенюРазмещенныеСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПунктМенюРазмещенныеСтроки()
	
	Если РазмещенныеТоварыПоказаны = Ложь Тогда
		Элементы.МенюПоказатьРазмещенные.Видимость  = Истина;
		Элементы.МенюСкрыватьРазмещенные.Видимость = Ложь;
		ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ПоказыватьРазмещенные", Ложь);
	Иначе
		Элементы.МенюПоказатьРазмещенные.Видимость  = Ложь;
		Элементы.МенюСкрыватьРазмещенные.Видимость = Истина;		
		ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ПоказыватьРазмещенные", Истина);
	КонецЕсли; 

	Элементы.ТоварыДокумента.Обновить();	
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);	
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокДокументовПТУ(, Объект.ДокументГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	Запись = РезультатСтруктура.Данные[0];
	ЭтаФорма.Шапка.Очистить();
	СтрокаТЗ = Шапка.Добавить();
	СтрокаТЗ.ЗаголовокСкладскогоДокумента = "В работе";
	СтрокаТЗ.НомерСкладскогоДокумента = Объект.НомерСкладскогоДокумента;
	
	ОсталосьЗначение = Строка(Запись.КоличествоТовараОсталостьРазместить);
	СтрокаТЗ.ОписаниеСтатусаДокумента = "не размещено: " + Строка(Запись.КоличествоОсталостьРазместитьСтрокГМ) + " грузомест";
	
	РазмещенныеТоварыПоказаны = Ложь;
	ПоказатьПунктМенюРазмещенныеСтроки();
	
	ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаПТУ", Параметры.ДокументГУИД);
	
	//Элементы.ТоварыДокумента.КонтекстноеМеню.ТоварыДокументаКонтекстноеМенюВыбратьДляРазмещения
	
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);		
	ОбновитьСлуженоеСообщениеПодвал();
	
	Если Параметры.СобытиеПрисвоитьШтрихкод = Истина Тогда
		
		Элементы.ТоварыДокумента.КонтекстноеМеню.ПодчиненныеЭлементы.ТоварыДокументаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Истина;
		Элементы.ТоварыДокумента.КонтекстноеМеню.ПодчиненныеЭлементы.ТоварыДокументаКонтекстноеМенюВыбратьДляРазмещения.Видимость = Ложь;
		
	Иначе 
		
		Элементы.ТоварыДокумента.КонтекстноеМеню.ПодчиненныеЭлементы.ТоварыДокументаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Ложь;
		Элементы.ТоварыДокумента.КонтекстноеМеню.ПодчиненныеЭлементы.ТоварыДокументаКонтекстноеМенюВыбратьДляРазмещения.Видимость = Истина;
		
	КонецЕсли;
	СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", "");	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();
	СтрокаТЗ.ФИОСотрудника = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДействийДляПользователя("", ЭтаФорма.ИмяФормы);
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьДляРазмещения(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЯчейкаПриемкиГУИД) Тогда
		ПоказатьПредупреждение(,"Ошибка: сначала выберите ячейку приемки !!!" , 3);	
		Возврат
	КонецЕсли; 
	
	
	ТоварГУИД  = Элементы.ТоварыДокумента.ТекущиеДанные.СсылкаТовара;
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ТоварГУИД", ТоварГУИД);
	Закрыть( СписокПараметров );
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДляПрисвоенияШК(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЯчейкаПриемкиГУИД) Тогда
		ПоказатьПредупреждение(,"Ошибка: сначала выберите ячейку приемки !!!" , 3);	
		Возврат
	КонецЕсли; 
	
	
	ТоварГУИД  = Элементы.ТоварыДокумента.ТекущиеДанные.СсылкаТовара;
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ТоварГУИД", ТоварГУИД);
	СписокПараметров.Вставить("СобытиеПрисвоитьШтрихкод", Истина);
	Закрыть( СписокПараметров );

	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументаПриАктивизацииСтроки(Элемент) 
	//Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда 
	//	ОбработкаОтсканированногоТовара(Ложь,Элемент.ТекущиеДанные.СсылкаТовара,Ложь);
	//	СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", Элемент.ТекущиеДанные.СсылкаТовара); 
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте                                                              
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если Событие = "UniversalBroadcastEvent" Тогда
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
		КонецЕсли; 
		Штрихкод = Результат.Штрихкод; 
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработкаОтсканированногоТовара();	
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиТоварВДокументеПоКоду(мШтрихКод)
	ГУИДТовара = Неопределено;
	ЗапросТовараВДокументе = Новый Запрос; 
	ЗапросТовараВДокументе.УстановитьПараметр("КодПроизводителяТовара","%"+мШтрихКод+"%");
	ЗапросТовараВДокументе.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокТоваровДокументаПТУ.СсылкаТовара КАК СсылкаТовара
	|ИЗ
	|	РегистрСведений.СписокТоваровДокументаПТУ КАК СписокТоваровДокументаПТУ
	|ГДЕ
	|	СписокТоваровДокументаПТУ.КодПроизводителяТовара Подобно &КодПроизводителяТовара";
	РезультатЗапроса = ЗапросТовараВДокументе.Выполнить();
	Если НЕ РезультатЗапроса.Пустой()Тогда
		ГУИДТовара = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СсылкаТовара");
		//ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		//ВыборкаЗапроса.Следующий();
		//ГУИДТовара = ВыборкаЗапроса.СсылкаТовара;
	КонецЕсли;	
	Возврат ГУИДТовара;	
КонецФункции

&НаКлиенте
Процедура ОбработкаОтсканированногоТовара(ВведеноЗначениеПоиска = Ложь,ТоварИзСпискаНайденных = "",Фильтровать = Истина)
	//// Найти товар по штрихкоду 
	Если ВведеноЗначениеПоиска Тогда
		ШтрихКод = ЭтаФорма.Поиск;
		ЭтаФорма.Поиск = "";
	КонецЕсли;	
	РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоШтрихкодуСОстатками(ШтрихКод, ТоварИзСпискаНайденных);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Штрихкод = "";
		Возврат;
	КонецЕсли;
   	ПромТоварГУИД = Новый Массив;
	Если РезультатСтруктура.Данные.Количество() = 1 Тогда 
		ПромТоварГУИД.Добавить(РезультатСтруктура.Данные[0].Владелец);
		Если Фильтровать Тогда
			ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ФильтруемПоТовару", Истина);
			ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаНаТовар", ПромТоварГУИД); 
		КонецЕсли;
		СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", ПромТоварГУИД[0]);
	ИначеЕсли РезультатСтруктура.Данные.Количество() > 0 Тогда
		Если  ВведеноЗначениеПоиска Тогда
			ЕстьТовар =  НайтиТоварВДокументеПоКоду(ШтрихКод);
			Если НЕ ЕстьТовар = Неопределено Тогда
				Если Фильтровать Тогда 
					ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ФильтруемПоТовару", Истина);
					ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаНаТовар", ЕстьТовар); 
				КонецЕсли;
				СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", ЕстьТовар[0]);
			Иначе
				ПромТоварГУИД.Добавить(РезультатСтруктура.Данные[0].Владелец);
				Если Фильтровать Тогда
				ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ФильтруемПоТовару", Истина);
					ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаНаТовар", ПромТоварГУИД); 
				КонецЕсли;
				СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", ПромТоварГУИД[0]);
			КонецЕсли;
		Иначе
			ПромТоварГУИД.Добавить(РезультатСтруктура.Данные[0].Владелец);
			Если Фильтровать Тогда 
				ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ФильтруемПоТовару", Истина); 
				ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаНаТовар", ПромТоварГУИД); 
			КонецЕсли;
			СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", ПромТоварГУИД[0]);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОчиститьПоиск(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)
	ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаНаТовар", "");
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Если Не ЗначениеЗаполнено(ЭтаФорма.Поиск) Тогда
		ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаНаТовар", "");
		ПоказатьПредупреждение(, "Введите код производителя !!!", 4);
		Возврат;
	КонецЕсли; 
	ОбработкаОтсканированногоТовара(Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокНайденныхТоваровПоШтрихкоду");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	ЭтаФорма.Поиск = "";
	ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ФильтруемПоТовару", Ложь); 
	ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаНаТовар", "");
КонецПроцедуры


ШтрихКод = "";
